AssemblyLineManager.Warehouse/InsertItem.xml

<?xml version="1.0"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <s:Body>
    <m:InsertItem xmlns:m="http://tempuri.org/">
      <m:trayId>6</m:trayId>
      <m:name>Marcus</m:name>
    </m:InsertItem>
  </s:Body>
</s:Envelope>